src/InformationRegisters/кфкКЭШФайловВерсииСпецификации/кфкКЭШФайловВерсииСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кфкКЭШФайловВерсииСпецификации</name>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеФайла</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>DocumentRef.кфкВерсияСпецификации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипФайла</name>
    <type>
      <types>EnumRef.кфкТипыФайловВерсииСпецификации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кфкКЭШФайловВерсииСпецификации/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает КЭШ файла версии спецификации.
// 
// Параметры:
//	Версия - ДокументСсылка.кфкВерсияСпецификации - Версия спецификации
//	ТипФайла - ПеречислениеСсылка.кфкТипыФайловВерсииСпецификации - Тип файла
// 
// Возвращаемое значение:
//	Неопределено, Структура - Файл из КЭШа:
//		* ИмяФайла - Строка - Имя файла 
//		* ДанныеФайла - ДвоичныеДанные - Данные файла 
Функция ПолучитьКЭШ(Версия, ТипФайла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Т.ИмяФайла КАК ИмяФайла,
		|	Т.ДанныеФайла КАК ДанныеФайла
		|ИЗ
		|	РегистрСведений.кфкКЭШФайловВерсииСпецификации КАК Т
		|ГДЕ
		|	Т.Версия = &Версия
		|	И Т.ТипФайла = &ТипФайла";
	Запрос.УстановитьПараметр("Версия", Версия);
	Запрос.УстановитьПараметр("ТипФайла", ТипФайла);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//@skip-check constructor-function-return-section
		Возврат Новый Структура("ИмяФайла, ДанныеФайла", Выборка.ИмяФайла, Выборка.ДанныеФайла.Получить());
		
	Иначе
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Обновляет КЭШ файла версии спецификации
// 
// Параметры:
//	Версия - ДокументСсылка.кфкВерсияСпецификации - Версия спецификации
//	ТипФайла - ПеречислениеСсылка.кфкТипыФайловВерсииСпецификации - Тип файла
//	Файл см. кфкРаботаСоСпецификациями.СформироватьAsyncAPI
Процедура ОбновитьКЭШ(Версия, ТипФайла, Файл) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Версия = Версия;
	Запись.ТипФайла = ТипФайла;
	Запись.ИмяФайла = Файл.ИмяФайла;
	Запись.ДанныеФайла = Новый ХранилищеЗначения(Файл.ДанныеФайла);
	Запись.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
